// Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.Write("Введите трёхзначное число: ");
string strValue = Console.ReadLine();

Console.WriteLine($"вторая цифра трёхзначного числа {strValue[1]}");


